import React from "react";
import AppliedLogicNavigation from "./AppliedLogicNavigation";

function AppliedLogicUses() {

    return (
        <div className="fullPageWithNavigation">  
        <div>
            <AppliedLogicNavigation />
            </div> 
            <div className="fullPageWoutNavigation appliedLogic">
            <h1>Що таке логіка? <br />
                Як формальна логіка перетворюється у прикладну?</h1>

            <p>Як відомо, кожна наука прагне до максимальної точності 
                і обґрунтованості своїх положень. Обґрунтовуючи ті чи 
                інші твердження, вчені користуються різними логічними 
                прийомами. При цьому потрібна впевненість, що самі ці 
                логічні прийоми та операції є правильними й правомірними. 
                Завдання <b>логіки</b> саме в тому й полягає, щоб обґрунтувати 
                логічні операції, встановити умови їх правильності, показати, 
                де і для яких цілей можна їх використати.</p>

            <p><em>Правове мислення </em>має свої специфічні процедурні засоби. 
                Важливе місце серед них посідає <b>формальна логіка</b>. 
                Отримання поняття, судження, умовиводу – це певне накопичення інформації, 
                а узгоджена з визнанням якоїсь загальної мови реалізація цих понять – 
                аргумент рішення, яке приймається.</p>

                <hr />

            <p><b>Формальна логіка </b>може бути визначена як наука про закони 
                і форми правильного мислення або наука про закони і форми 
                теоретичного пізнання на рівні <em>абстрактного мислення</em>. 
                Головним предметом її є аналіз правильності <b>міркування і мовлення</b>, 
                <b>формулювання законів і принципів</b>, дотримання яких є 
                необхідною умовою істинності висновків. <br /> <br />

                Особливість правильного теоретичного пізнання полягає в тому, 
                що істинні, вірні міркування і посилки завжди ведуть до істинного 
                висновку і вірного способу пізнання. Вірним буде, скажімо, таке розмірковування: 
                “Якщо є причина, відповідно є наслідок”, “Має місце певне явище, відповідно, 
                повинна бути і його конкретна причина”. <br /> <br />

                Тобто <b>формальну логіку </b>також можна назвати <em>наукою</em>, яка 
                вивчає форми мислення з точки зору їх структури, закони і правил 
                досягнення похідного знання. Ця наука вивчає загальні прийоми, 
                що використовує людина у процесі теоретичного пізнання дійсності.</p>

                <hr />

            <p><b>Формальна логіка </b>- логіка, яка вивчає формальну структуру 
                мислення, абстрагуючись від його змісту, процес міркувань, 
                відокремлюючи їх абстрактні форми, виражені певною мовою. <br /> <br />

                Сфера досліджень сучасної <em>формальної логіки </em>- це особливості 
                побудови формальних систем (логічних числень) і можливостей їх інтерпретації.</p>

            <p><b>Неформальна логіка </b>- новий напрям сучасних логічних досліджень, 
                спрямований на моделювання мовленнєвих актів - міркувань, що створює 
                людина в повсякденному житті певною мовою. <em>Неформальна логіка </em>трактується 
                як "реанімація" традиційної логіки Арістотеля, зокрема тих його логічних праць 
                ("Топіка", "Про софістичні спростування"), які уособлюють сферу повсякденних 
                міркувань (А. Шуман). Предметом дослідження сучасної <em>неформальної логіки </em> 
                (теорії мовленнєвих актів) є логічна структура повсякденної мови, способи 
                використання природної мови; аналіз висловлювань як виявлення ментального стану людини.</p>

            <p>Методологічна функція <em>формальної логіки </em>означає її практичне використання 
                суб'єктами практичної і теоретичної діяльності у процесі мислення, 
                внаслідок чого <em>формальна логіка </em>стає <b>прикладною логікою</b>.</p>

            </div>
            

        </div>
    )
}

export default AppliedLogicUses