import React from "react";
import AppliedLogicNavigation from "./AppliedLogicNavigation";

function AppliedLogicPractice() {

    return (
        <div className="fullPageWithNavigation">  
        <div>
            <AppliedLogicNavigation />
            </div> 
            <div className="fullPageWoutNavigation appliedLogic SequentCalculus">
            <h1>Практиче значення логіки</h1>

            <p>Для того, щоб <em>практично </em>використовувати будь-яку 
                наукову теорію або теоретичну систему знання, в тому числі, 
                <b> логіку</b>, або скажімо, теорію права, її необхідно 
                перетворити (трансформувати) в практичний метод.</p>

            <p>Особливість <b>науки логіки </b>полягає в тому, що її 
                практичне використання здійснюється у сфері мислення людини, 
                коли мислення виконує свої головні функції - пізнавальну, 
                прогнозуючу, створення ідеальних програм (моделей) практичної 
                і теоретичної діяльності, вирішення практичних і теоретичних проблем, 
                встановлення складних опосередкованих зв'язків та 
                відношень між предметами і явищами об'єктивного світу.</p> 

            <hr />         

            <p><b>Теоретична логіка </b>(сукупність логічних теорій) 
                досліджує мислення в формальному аспекті, тобто вона 
                абстрагується від його конкретного змісту і визначає 
                інваріанти мислення, які є універсальними для всіх людей.</p>  

            <p>На підставі теоретичного вивчення форм і законів 
                мислення <b>теоретична логіка </b>формулює 
                принципи і правила <b>логічного мислення</b>.</p>

            <p>Принципи <em>логічного мислення </em>(визначеність думки, 
                несуперечливість, послідовність думки, обґрунтованість думки) 
                формулюються на підставі логічних законів (іноді поняття 
                "принцип мислення" і "закон мислення" ототожнюються).</p>

            <p>На підставі законів у <b>теоретичній логіці </b>формулюються 
                правила <em>логічного мислення</em>. Правила <em>логічного мислення </em>
                встановлюють умови, яких необхідно дотримуватися, коли людина виконує 
                інтелектуальні (розумові) дії, тобто логічні операції з об'єктами мислення 
                - поняттями, висловлюваннями, що виражені в знаково-символічній формі. 
                До правил <em>логічного мислення </em>відносяться: 
                    <ul>
                        <li>Правила здійснення логічних операцій над поняттями, над висловлюваннями;</li>
                        <li>Правила побудови умовиводів;</li>
                        <li>Правила доведення і спростування.</li>
                    </ul>
            </p>

            <hr /> 

            <p>Основні норми <b>логічного мислення</b>, які є 
                загальними для всіх людей. Вони полягають у необхідності:
                    <ul>
                        <li>Дотримуватись у своєму мисленні законів логіки;</li>
                        <li>Здійснювати інтелектуальні дії (операції) відповідно 
                            до правил, які сформульованих у <em>теоретичній логіці</em>;</li>
                        <li>Виділяти із сукупності ознак і властивостей, притаманних 
                            об'єктам думки, суттєві ознаки у процесі пізнання;</li>
                        <li>Точно і адекватно підводити те чи інше явище, той чи 
                            інший предмет під категорію, тобто давати правильне 
                            найменування об'єктам пізнання і практичної дії;</li>
                        <li>Аргументувати свої положення (тези) істинними доказами;</li>
                        <li>При побудові гіпотез (версій) враховувати як можна більш 
                            фактів і суттєвих ознак, щоб дана гіпотеза була більш ймовірною.</li>
                    </ul>    
            </p>

            <p>Основні <em>логічні </em>дії, які відносяться до <b>практичних </b>прийомів мислення:
                <ul>
                    <li>Логічні дії над поняттями (визначення понять, узагальнення і 
                        обмеження понять, поділ понять, класифікація понять за родами, 
                        видами, типами, операції над класами, встановлення відношень між 
                        поняттями за принципом сумісності і несумісності та їх схематичне 
                        зображення за допомогою кіл Ейлера або діаграм Вена);</li>
                    <li>Логічні дії над висловлюваннями: 
                        <ol>
                            <li>Встановлення істинності простих атрибутивних висловлювань за "логічним квадратом",</li>
                            <li>Встановлення логічних зв'язків між простими висловлюваннями</li>
                            <li>Створення складних висловлювань за допомогою логічних 
                                операцій кон'юнкції, диз'юнкції, імплікації, заперечення,</li>
                            <li>Визначення істинності складних висловлювань за допомогою таблиць істинності,</li>
                            <li>Логічна операція квантифікації;</li>
                        </ol>    
                    </li>
                    <li>Логічні операції побудови необхідного умовиводу за 
                        правилами логіки висловлювань і логіки предикатів;</li>
                    <li>Логічні операції побудови індуктивного умовиводу 
                        (теоретичне узагальнення емпіричних даних або фактів);</li>
                    <li>Встановлення відповідності (аналогії) між певними 
                        предметами і явищами (умовивід за аналогією);</li>
                    <li>Логічні операції доведення і спростування.</li>
                </ul>
            </p>

            <hr /> 
            
            <p>Таким чином, <b>практичне </b>використання <em>теоретичної логіки </em>
                в різних галузях діяльності людей має таку послідовність: 
                <ol>
                    <li>Постановка мети діяльності;</li>
                    <li>Розробка практичного методу мислення (методології 
                        логічного мислення або системи правил логічного мислення);</li>
                    <li>Розробка методики використання логічних методів при 
                        рішенні конкретний задач (логічного аналізу текстів, 
                        аналізу мови, побудови моделей діяльності і т. д.);</li>
                    <li>Здійсненні конкретних інтелектуальних дій (операції) над поняттями</li>
                    <li>Висловлюваннями на підставі принципів, законів і правил <b>науки логіки</b>.</li>
                </ol> 
             </p>
            

            </div>
            

        </div>
    )
}

export default AppliedLogicPractice