import React from "react";
import { BrowserRouter as Router, Switch, Route, Link } from "react-router-dom"
import AppliedLogicNavigation from "./AppliedLogicNavigation";

function AppliedLogicInfo() {

    return (
        <div className="fullPageWithNavigation">  
        <div>
            <AppliedLogicNavigation />
            </div> 
            <div className="fullPageWoutNavigation appliedLogic">
                <h1>Прикладна логіка - що це?</h1>
                <p><b>Прикладна логіка</b> - сфера застосування науки логіки; 
                    різноманітність практичного використання логічних теорій, 
                    унаслідок чого логіка виконує методологічну функцію і набуває прикладного значення. 
                    Практичне використання логічних теорій має форму <b>інтерпретації</b>. 
                    Інтерпретована в певній сфері практичної та пізнавальної діяльності людей 
                    логічна теорія називається <b>моделлю</b>.
                </p>


                <p><b>До прикладних логік належать:</b>
                    <ul> 
                        <li>Комп'ютерна логіка; </li>
                        <li>Логіка науки; </li>
                        <li>Логіка дискурсу; </li>
                        <li>Юридична логіка; </li>
                        <li>Інші напрями формальних і неформальних логічних досліджень, 
                            пов'язаних із конкретною сферою наукового пізнання 
                            та практичного використання логічного знання.</li>
                    </ul> 
                </p>

                <hr />

                <p><b>Комп’ютерна логіка</b> – навчальна дисципліна, 
                    яка вивчає специфіку використання комп’ютера 
                    для розв’язання логічних завдань. 
                    Це предмет, що досліджує можливості інформаційних технологій 
                    у процесі аналізу схем і будови комп’ютера. Також це курс, 
                    що займається вивченням методів і прийомів аналізу схем, 
                    процесів, заснованих на об’єктах цифрової пам’яті.
                </p>

                <p><em>Предметом вивчення курсу</em> <b>Комп’ютерна логіка </b> 
                є схеми та процеси, що базуються на цифрових технологіях. 
                Способи, методи й засоби вивчення цих схем і процесів становлять 
                об’єкт предмета <b>Комп’ютерна логіка.</b></p>
                
                <p><b>Комп’ютерна логіка</b> як навчальна 
                дисципліна ставить перед студентами ряд завдань:
                    <ul>
                        <li>Розвивати логічний стиль мислення;</li>
                        <li>Навчитися створювати і працювати з пристроями, 
                            що ґрунтуються на цифрових технологіях;</li>
                        <li>Опанувати методику розробки та деталізації 
                            схем і процесів пристроїв комп’ютера;</li>
                        <li>Навчитися використовувати <em>інформаційні технології </em>
                            для деталізації схем, процесів цифрових пристроїв;</li>
                        <li>Навчитися обробляти різноманітні інформаційні дані, 
                            зокрема виконувати арифметичні дії в операційних автоматах.</li>
                    </ul>
                </p>

                <p><em>Метою</em> вивчення дисципліни <b>Комп’ютерна логіка </b> 
                є формування у студентів умінь і навичок, 
                необхідних для роботи зі схемами та процесами цифрових пристроїв, 
                для створення і розшифрування цифрових схем.</p>

                <hr />

                <p><b>Логіка науки</b> та <b>Логіка дискурсу</b> - 
                сукупність логічних засобів обґрунтування істинності 
                будь-якого судження за допомогою інших істинних і 
                пов’язаних з ним суджень. Структура доведення складається з 
                тези, аргументів, демонстрації (форми доведення).</p>

                <p><b>Теза</b> — це судження, істинність якого треба довести.</p>

                <p><b>Аргументи</b> — це ті істинні судження, 
                якими користуються при доведенні тези.</p>

                <p>Розрізняють такі види аргументів: 
                    <ul>
                        <li>Вірогідні одиничні акти; </li>
                        <li>Визначення; </li>
                        <li>Аксіоми; </li>
                        <li>Постулати (раніше доведені закони науки та теореми).</li>
                    </ul>
                </p>

                <p><b>Демонстрацією</b> (формою доведення) 
                називається засіб логічного зв’язку між тезою та аргументом, 
                який веде до встановлення бажаної істини.</p>

                <p><b>Дискурс</b> - це текст, що містить міркування, 
                тобто фіксована система певного руху думок.</p>

                <hr />

                <p><b>Юридична логіка</b> вивчає закони і форми юридичного 
                мислення, спрямованого на пошук істини. </p>
                
                <p>Навчає, як у процесі юридичної діяльності правильно будувати 
                    <em> умовиводи</em>, <em>доведення</em>, прищеплює вміння правильно 
                    <em> оперувати поняттями</em> й <em>судженнями</em>, 
                    застерігає від можливих <em>логічних помилок</em>.</p> 
                    
                <p>Незнання її законів та правил, невміння користуватися ними 
                    в процесі правового дослідження нерідко призводять до 
                    різноманітних логічних помилок, котрі в професійній 
                    діяльності юриста одночасно виявляються юридичними помилками. 
                    <b> Тому</b> законодавець визнав за необхідне закріпити вимоги 
                    основних законів логіки в нормах права, 
                    перевести їх до рангу нормативних вимог.</p>
            </div>
            

        </div>
    )
}

export default AppliedLogicInfo