import React from "react";
import AppliedLogicNavigation from "./AppliedLogicNavigation";

function AppliedLogicUses() {

    return (
        <div className="fullPageWithNavigation">  
        <div>
            <AppliedLogicNavigation />
            </div> 
            <div className="fullPageWoutNavigation appliedLogic SequentCalculus">
            <h1>Прикладна логіка - що це?</h1>
                <p><b>Прикладна логіка</b> - сфера застосування науки логіки; 
                    різноманітність практичного використання логічних теорій, 
                    унаслідок чого логіка виконує методологічну функцію і набуває прикладного значення. 
                    Практичне використання логічних теорій має форму <b>інтерпретації</b>. 
                    Інтерпретована в певній сфері практичної та пізнавальної діяльності людей 
                    логічна теорія називається <b>моделлю</b>.
                </p>


                <p><b>До прикладних логік належать:</b>
                    <ul> 
                        <li>Комп'ютерна логіка; </li>
                        <li>Логіка науки; </li>
                        <li>Логіка дискурсу; </li>
                        <li>Юридична логіка; </li>
                        <li>Інші напрями формальних і неформальних логічних досліджень, 
                            пов'язаних із конкретною сферою наукового пізнання 
                            та практичного використання логічного знання.</li>
                    </ul> 
                </p>

                <hr />

                <p><b>Комп’ютерна логіка</b> – навчальна дисципліна, 
                    яка вивчає специфіку використання комп’ютера 
                    для розв’язання логічних завдань. 
                    Це предмет, що досліджує можливості інформаційних технологій 
                    у процесі аналізу схем і будови комп’ютера. Також це курс, 
                    що займається вивченням методів і прийомів аналізу схем, 
                    процесів, заснованих на об’єктах цифрової пам’яті.
                </p>

                <p><em>Предметом вивчення курсу</em> <b>Комп’ютерна логіка </b> 
                є схеми та процеси, що базуються на цифрових технологіях. 
                Способи, методи й засоби вивчення цих схем і процесів становлять 
                об’єкт предмета <b>Комп’ютерна логіка.</b></p>
                
                <p><b>Комп’ютерна логіка</b> як навчальна 
                дисципліна ставить перед студентами ряд завдань:
                    <ul>
                        <li>Розвивати логічний стиль мислення;</li>
                        <li>Навчитися створювати і працювати з пристроями, 
                            що ґрунтуються на цифрових технологіях;</li>
                        <li>Опанувати методику розробки та деталізації 
                            схем і процесів пристроїв комп’ютера;</li>
                        <li>Навчитися використовувати <em>інформаційні технології </em>
                            для деталізації схем, процесів цифрових пристроїв;</li>
                        <li>Навчитися обробляти різноманітні інформаційні дані, 
                            зокрема виконувати арифметичні дії в операційних автоматах.</li>
                    </ul>
                </p>

                <p><em>Метою</em> вивчення дисципліни <b>Комп’ютерна логіка </b> 
                є формування у студентів умінь і навичок, 
                необхідних для роботи зі схемами та процесами цифрових пристроїв, 
                для створення і розшифрування цифрових схем.</p>

                <hr />

                <p><b>Логіка науки</b> та <b>Логіка дискурсу</b> - 
                сукупність логічних засобів обґрунтування істинності 
                будь-якого судження за допомогою інших істинних і 
                пов’язаних з ним суджень. Структура доведення складається з 
                тези, аргументів, демонстрації (форми доведення).</p>

                <p><b>Теза</b> — це судження, істинність якого треба довести.</p>

                <p><b>Аргументи</b> — це ті істинні судження, 
                якими користуються при доведенні тези.</p>

                <p>Розрізняють такі види аргументів: 
                    <ul>
                        <li>Вірогідні одиничні акти; </li>
                        <li>Визначення; </li>
                        <li>Аксіоми; </li>
                        <li>Постулати (раніше доведені закони науки та теореми).</li>
                    </ul>
                </p>

                <p><b>Демонстрацією</b> (формою доведення) 
                називається засіб логічного зв’язку між тезою та аргументом, 
                який веде до встановлення бажаної істини.</p>

                <p><b>Дискурс</b> - це текст, що містить міркування, 
                тобто фіксована система певного руху думок.</p>

                <hr />

                <p><b>Юридична логіка</b> вивчає закони і форми юридичного 
                мислення, спрямованого на пошук істини. </p>
                
                <p>Навчає, як у процесі юридичної діяльності правильно будувати 
                    <em> умовиводи</em>, <em>доведення</em>, прищеплює вміння правильно 
                    <em> оперувати поняттями</em> й <em>судженнями</em>, 
                    застерігає від можливих <em>логічних помилок</em>.</p> 
                    
                <p>Незнання її законів та правил, невміння користуватися ними 
                    в процесі правового дослідження нерідко призводять до 
                    різноманітних логічних помилок, котрі в професійній 
                    діяльності юриста одночасно виявляються юридичними помилками. 
                    <b> Тому</b> законодавець визнав за необхідне закріпити вимоги 
                    основних законів логіки в нормах права, 
                    перевести їх до рангу нормативних вимог.</p>

                <hr />

                <h1>Що таке логіка? <br />
                Як формальна логіка перетворюється у прикладну?</h1>

                <p>Як відомо, кожна наука прагне до максимальної точності 
                    і обґрунтованості своїх положень. Обґрунтовуючи ті чи 
                    інші твердження, вчені користуються різними логічними 
                    прийомами. При цьому потрібна впевненість, що самі ці 
                    логічні прийоми та операції є правильними й правомірними. 
                    Завдання <b>логіки</b> саме в тому й полягає, щоб обґрунтувати 
                    логічні операції, встановити умови їх правильності, показати, 
                    де і для яких цілей можна їх використати.</p>

                <p><em>Правове мислення </em>має свої специфічні процедурні засоби. 
                    Важливе місце серед них посідає <b>формальна логіка</b>. 
                    Отримання поняття, судження, умовиводу – це певне накопичення інформації, 
                    а узгоджена з визнанням якоїсь загальної мови реалізація цих понять – 
                    аргумент рішення, яке приймається.</p>

                    <hr />

                <p><b>Формальна логіка </b>може бути визначена як наука про закони 
                    і форми правильного мислення або наука про закони і форми 
                    теоретичного пізнання на рівні <em>абстрактного мислення</em>. 
                    Головним предметом її є аналіз правильності <b>міркування і мовлення</b>, 
                    <b>формулювання законів і принципів</b>, дотримання яких є 
                    необхідною умовою істинності висновків. <br /> <br />

                    Особливість правильного теоретичного пізнання полягає в тому, 
                    що істинні, вірні міркування і посилки завжди ведуть до істинного 
                    висновку і вірного способу пізнання. Вірним буде, скажімо, таке розмірковування: 
                    “Якщо є причина, відповідно є наслідок”, “Має місце певне явище, відповідно, 
                    повинна бути і його конкретна причина”. <br /> <br />

                    Тобто <b>формальну логіку </b>також можна назвати <em>наукою</em>, яка 
                    вивчає форми мислення з точки зору їх структури, закони і правил 
                    досягнення похідного знання. Ця наука вивчає загальні прийоми, 
                    що використовує людина у процесі теоретичного пізнання дійсності.</p>

                    <hr />

                <p><b>Формальна логіка </b>- логіка, яка вивчає формальну структуру 
                    мислення, абстрагуючись від його змісту, процес міркувань, 
                    відокремлюючи їх абстрактні форми, виражені певною мовою. <br /> <br />

                    Сфера досліджень сучасної <em>формальної логіки </em>- це особливості 
                    побудови формальних систем (логічних числень) і можливостей їх інтерпретації.</p>

                <p><b>Неформальна логіка </b>- новий напрям сучасних логічних досліджень, 
                    спрямований на моделювання мовленнєвих актів - міркувань, що створює 
                    людина в повсякденному житті певною мовою. <em>Неформальна логіка </em>трактується 
                    як "реанімація" традиційної логіки Арістотеля, зокрема тих його логічних праць 
                    ("Топіка", "Про софістичні спростування"), які уособлюють сферу повсякденних 
                    міркувань (А. Шуман). Предметом дослідження сучасної <em>неформальної логіки </em> 
                    (теорії мовленнєвих актів) є логічна структура повсякденної мови, способи 
                    використання природної мови; аналіз висловлювань як виявлення ментального стану людини.</p>

                <p>Методологічна функція <em>формальної логіки </em>означає її практичне використання 
                    суб'єктами практичної і теоретичної діяльності у процесі мислення, 
                    внаслідок чого <em>формальна логіка </em>стає <b>прикладною логікою</b>.</p>

                {/* <hr /> */}

            

            
            </div>
            

        </div>
    )
}

export default AppliedLogicUses