import React from "react";
import MainPageNavigation from "./MainPageNavigation";

function HowToUse() {

    return (
        <div className="fullPageWithNavigation">  
        <div>
            <MainPageNavigation />
            </div> 
            <div className="fullPageWoutNavigation mainPage">
                <h1>Як користуватися сайтом?</h1>
                <h2>На сайті присутньо декілька основних вкладок:</h2>
                <div>
                    <h3>Прикладна логіка</h3>
                    <p>Вкладка <b><em> "Прикладна логіка" </em></b> розповідає про Прикладну Логіку, а саме:
                        <ul>
                            <li>Що таке Прикладна логіка</li>
                            <li>Що належить до Прикладних логік</li>
                            <li>Мета Прикладної логіки</li>
                        </ul>
                        Також, окрім цього, її практичне значення, її формування та що таке 
                        <b> Логіка </b> в цілому та як формальна логіка перетворюється у прикладну.
                    </p>

                <hr />

                    <h3>Секвенційні числення</h3>
                    <p>Вкладка <b><em> "Секвенційні числення" </em></b> надасть таку інформацію про Секвенційні числення:
                        <ul>
                            <li>Що таке Секвенційні числення (Числення секвенцій)</li>
                            <li>Їх побудову та практичне значення</li>
                            <li>Приклади Секвенційних числень</li>
                        </ul>
                        Та додаткову інформацію про створення Секвенційних числень.
                    </p>

                <hr />

                    <h3>Інформація про автора</h3>
                    <p>На вкладці <b><em> "Інформація про автора" </em></b> присутня інформація про мене. 
                        Загальна інформація, мій досвід роботи та як зі мною зв'язатися.
                    </p>
                </div>
            </div>
            

        </div>
    )
}

export default HowToUse