import React from "react";
import SequentCalculusNavigation from "./SequentCalculusNavigation";

function SequentCalculusInfo() {

    return (
        <div className="fullPageWithNavigation">  
        <div>
            <SequentCalculusNavigation />
            </div> 
            <div className="fullPageWoutNavigation SequentCalculus">
            <h1>Секвенційні числення</h1>
            <p><b> Числення секвенцій </b>— система формального виведення формул 
                логіки першого порядку (і як часткового випадку логіки висловлень) 
                запропонована німецьким логіком <b>Ґергардом Ґенценом</b>. Після праці 
                Ґенцена розроблено кілька варіантів <em>числення секвенцій</em>, що є 
                еквівалентними між собою і альтернативою аксіоматичному підходу.</p>

            <p><b>Числення секвенцій </b>є альтернативною системою формального виводу 
            до <em> аксіоматичних </em>систем описаних у статтях <b> Числення висловлень </b> і 
            <b> Логіка першого порядку</b>. Формули логіки першого порядку для поданої 
            нижче формальної системи мають лише дві логічні зв'язки (¬,V) і квантор існування. 
            Інші символи логічних зв'язок можна визначити формулами: 

            <br />
            <img src={require("./pngs/first.png")} alt="first" className="firstPNG"/>
            <br />

            Подібно визначається і квантор загальності:

            <br />
            <img src={require("./pngs/second.png")} alt="second" className="secondPNG"/>
            <br />

            Загалом при визначенні правил використовуються такі позначення:

            <div className="third">
                <img src={require("./pngs/third.png")} alt="third" className="thirdPNG"/> 
                <span className="textInPNG">... (скінченні множини формул)</span>
            </div>

            <div className="third">
                <img src={require("./pngs/third2.png")} alt="third2" className="third2PNG"/> 
                <span className="textInPNG">... (формули логіки першого порядку)</span> 
            </div>

            <div className="third">
                <img src={require("./pngs/third3.png")} alt="third3" className="third3PNG"/> 
                <span className="textInPNG">... (Символ, що показує, що з формул з лівої сторони (антецеденту) виводяться формули з правої сторони (консеквент))</span> 
            </div>

            <div className="third">
                <img src={require("./pngs/third4.png")} alt="third4" className="third4PNG"/> 
                <span className="textInPNG">... (символ логічного заперечення)</span> 
            </div>

            <div className="third">
                <img src={require("./pngs/third5.png")} alt="third5" className="third5PNG"/> 
                <span className="textInPNG">... (символ диз'юнкції)</span> 
            </div>

            <div className="third">
                <img src={require("./pngs/third6.png")} alt="third6" className="third6PNG"/> 
                <span className="textInPNG">... (квантор існування)</span> 
            </div>
            </p>

            <hr />

            <p><b>Числення секвенцій </b> є <em> коректним </em> і <em> повним</em>. Тобто всі формули, що можна 
                вивести за його допомогою є логічно значимі і всі логічно значимі 
                формули можна вивести за допомогою <b> числення секвенцій</b>. Це еквівалентно 
                твердженню, що Ф |= φ тоді і тільки тоді коли Ф |- φ для довільних 
                множини формул Ф і формули φ.</p>

            <p><b>Секвенційні числення </b>безкванторно-функціональних логік можна розглядати
                як фрагменти відповідних числень <em>першопорядкових логік квазіарних предикатів
                функціональних рівнів</em>. Такі першопорядкові числення побудовано для
                відношення |=IR <em>логік еквітонних предикатів </em> <b>функціонального рівня </b>та
                <b> функціонального-екваційного рівня </b>з композицією слабкої рівності. Проте
                трактувати пропоноване тут числення FCE для <em>безкванторно-функціональних логік </em> зі
                слабкою рівністю як фрагмент описаного в відповідного першопорядкового
                числення FZNE можна з певним обмеженням: у числення з рівністю
                розглядаються як окремий випадок прикладних <b>секвенційних числень </b>із множиною
                власних аксіом для композиції рівності, а в пропонованих тут численнях властивості
                композиції рівності описуються за допомогою відповідних <b>секвенційних форм</b>. </p>

            <p><b>Секвенції </b>трактуємо як множини формул, специфікованих символами |– та –|.
                <b> Секвенційні числення </b>будуємо так: секвенція |–Г–|∆ вивідна ⇔ Г |= ∆. Секвенція Ʃ
                вивідна, якщо існує замкнене секвенційне дерево (кожний його лист – замкнена
                секвенція) з коренем Ʃ. Замкненість |–Г–|∆ означає Г |= ∆. <em> Секвенційне числення </em>
                задається базовими <em> секвенційними формами </em> та <em> умовами замкненості секвенції</em>. </p>

            </div>
            

        </div>
    )
}

export default SequentCalculusInfo