import React from "react";
import SequentCalculusNavigation from "./SequentCalculusNavigation";

function SequentCalculusInfo() {

    return (
        <div className="fullPageWithNavigation">  
        <div>
            <SequentCalculusNavigation />
            </div> 
            <div className="fullPageWoutNavigation SequentCalculus">
            <h1>Логіки предикатів над номінативними даними</h1>
            <p>
            <b>Логіки предикатів</b> над номінативними даними є розширенням <b>предикатної логіки</b>, 
            яка дозволяє виразити відношення та властивості об'єктів, використовуючи номінативні 
            (іменні) дані. Вони базуються на <em>предикатній логіці</em>, але зосереджуються на моделюванні 
            відношень між об'єктами, зокрема на домені іменованих об'єктів. <br /> <br />
            У цьому розділі вивчаються класи <b>композиційно-номінативних логік часткових предикатів над номінативними даними</b>. <br /> <br /> 
                Дані номінативного рівня будуються індуктивно з множини імен V та множини базових значень W. <br />
                Такі номінативні дані можна трактувати як <em>ієрархічно побудовані об’єкти</em>, в основі яких 
                лежить бінарне відношення <em>ім’я ו→ значення</em>. <br /> <br />
                При побудові складніших номінативних даних із простіших тут не будемо використовувати кроки побудови за типом множини. <br /> <br />
                - <b>Скінченні номінативні дані</b> називають просто <em>номінативними даними</em>, <br />
                - <b> однозначні скінченні номінативні дані</b> називають <em>іменними даними</em>. <br />
                - <b> Однорівневі однозначні номінативні дані</b> – це <em>іменні множини</em>. <br /> <br />

            Основну увагу в розділі приділено вивченню <b>логік над ієрархічними номінативними даними зі складеними іменами</b>. <br />
            Дано визначення такких даних, описано операції над ними. <br /> <br />
            Введено <b>нормальні форми</b> операції <em>видалення компонент із заданими префікс-іменами та операції реномінації</em>. <br /> <br />

            <em>Практичне значення</em> <b> логік предикатів над номінативними даними</b> полягає у 
            можливості <em>точно моделювати та аналізувати</em> відношення між об'єктами, зокрема у мові та базах даних. 
            Вони дозволяють формалізувати логічні властивості об'єктів, створювати запити та робити висновки на основі заданих правил. <br /> <br />
            
            Таким чином, <b>логіки предикатів над номінативними даними</b> є потужним інструментом для <em>моделювання</em> та 
            <em> аналізу відношень</em> між об'єктами в різних галузях знання. Вони дозволяють формалізувати та розв'язувати 
            складні логічні проблеми, що виникають у реальних ситуаціях. <br /> <br />
            </p>

            <hr />

            <h1>Приклади використання</h1>
            <p> 
            <b>Логіки предикатів над номінативними даними</b> знаходять широке застосування у різних галузях. 
            Ось декілька прикладів їх використання: <br /> <br />
            1. <b>Мовознавство</b>: Логіки предикатів над номінативними даними застосовуються у мовознавстві для аналізу мовних структур, синтаксичного та семантичного аналізу, машинного перекладу та комп'ютерного моделювання мови. <br /> <br />
            2. <b>Інформатика та штучний інтелект</b>: Логіки предикатів над номінативними даними використовуються у розробці експертних систем, систем розпізнавання образів, систем планування та інших інтелектуальних систем. <br /> <br />
            3. <b>Бази даних</b>: Логіки предикатів над номінативними даними застосовуються у моделюванні та управлінні базами даних. Вони дозволяють формалізувати відношення між об'єктами, створювати запити та аналізувати дані. <br /> <br />
            4. <b>Філософія та логіка</b>: Логіки предикатів над номінативними даними використовуються для формалізації філософських концепцій та логічного розуміння світу. Вони допомагають вивчати логічні відношення та робити висновки на основі заданих правил. <br /> <br />
            5. <b>Верифікація програмного забезпечення</b>: Логіки предикатів над номінативними даними використовуються для формалізації специфікацій та властивостей програмного забезпечення. Вони дозволяють проводити верифікацію програм шляхом логічного розуміння їхньої поведінки та властивостей. <br /> <br />
            6. <b>Юриспруденція</b>: Логіки предикатів над номінативними даними використовуються у правовідносинах для формалізації правових тверджень, аналізу правових розсуджень та автоматичної обробки юридичних текстів. <br /> <br />

            Це лише кілька прикладів галузей, де логіки предикатів над номінативними даними мають практичне значення. 
            Їх потужність та гнучкість дозволяють їх використовувати для моделювання та аналізу різних видів відношень між об'єктами у різних контекстах.
            </p>

            <hr />

            <hr />

            {/* <h1>Приклади</h1>
            <div className="picturePractice">
                <img src={require("./pngs/1.jpg")} alt="1" className="practice1"/> 
                <img src={require("./pngs/2.jpg")} alt="2" className="practice2"/> 
                <img src={require("./pngs/3.jpg")} alt="3" className="practice3"/> 
                <img src={require("./pngs/4.jpg")} alt="4" className="practice4"/> 
            </div> */}

{/* <h1>Логіки предикатів над номінативними даними</h1>
            <p>
            <b>Логіки предикатів над номінативними даними</b> є галуззю <em>логіки</em>, 
            яка вивчає методи та принципи використання предикатів для аналізу 
            та маніпуляції з номінативними даними. У цій галузі використовуються 
            <b> логічні висловлювання</b>, які мають ствердження або заперечення про відношення між об'єктами. <br /> <br />
            Історія <b>логік предикатів над номінативними даними</b> сягає коріння 
            класичної <em>логіки та філософії</em>. У 19-20 століттях були розроблені формальні системи 
            для виведення і розв'язання логічних проблем. У 20-му столітті ці ідеї були докладніше 
            розвинуті і застосовані у математиці та комп'ютерних науках. <br /> <br />
            Приклади використання <b>логік предикатів над номінативними даними включають</b>: <br /> <br />
            1. <b>Математика</b>: <em>Логіки предикатів над номінативними даними</em> широко використовуються в 
            математиці для формалізації та доведення математичних тверджень. Вони дозволяють точно 
            визначати властивості об'єктів та встановлювати логічні відношення між ними. <br /> <br />
            2. <b>Комп'ютерні науки</b>: <em>Логіки предикатів над номінативними даними</em> є основою для формалізації 
            та розв'язання <em>логічних проблем</em> у комп'ютерних науках. Вони використовуються в мовах програмування, 
            базах даних та штучному інтелекті для репрезентації та маніпуляції з даними. <br /> <br />
            3. <b>Штучний інтелект</b>: <em>Логіки предикатів над номінативними даними</em> є важливим інструментом 
            у галузі штучного інтелекту. Вони дозволяють висловлювати та розв'язувати логічні задачі, 
            такі як <em>розпізнавання образів, планування, мовний аналіз та розуміння</em>. <br /> <br />
            4. <b>Філософія</b>: <em>Логіки предикатів над номінативними даними</em> мають важливе значення 
            у філософії для аналізу мови, логічних аргументів та філософських тверджень. 
            Вони допомагають <em>формалізувати</em> та <em>аналізувати</em> логічну структуру розмірковування та аргументації. <br /> <br />
            Ці приклади використання демонструють широкий спектр застосування <b>логік предикатів 
            над номінативними даними</b> в різних галузях, де важливим є аналіз та маніпуляція логічними відношеннями між об'єктами. <br /> <br />
            Отже, <b>логіки предикатів над номінативними даними</b> є корисним інструментом для <em>аналізу, 
            моделювання та розв'язання проблем</em>, пов'язаних зі знаннями про об'єкти та їх взаємовідношеннями. 
            Вони знаходять широке застосування у <em>математиці, комп'ютерних науках, штучному інтелекті та філософії</em>. 
            Завдяки <b>логікам предикатів над номінативними даними</b>, ми можемо <em>формалізувати логічні висловлювання, 
            встановлювати логічні відношення між об'єктами, розв'язувати складні логічні задачі та забезпечувати точнішу репрезентацію знань</em>. 
            Це дозволяє нам зробити більш точні прогнози, приймати обґрунтовані рішення та аналізувати складні системи, що містять номінативні дані.
            </p> */}

            {/* <hr /> */}
            <br />
            <div className="picturePractice">
                <img src={require("./third/1.jpg")} alt="1" className="practice1"/> 
                <img src={require("./third/2.jpg")} alt="2" className="practice1"/> 
                <img src={require("./third/3.jpg")} alt="3" className="practice1"/> 
                <img src={require("./third/4.jpg")} alt="4" className="practice1"/> 
                <img src={require("./third/5.jpg")} alt="5" className="practice1"/> 
                <img src={require("./third/6.jpg")} alt="6" className="practice1"/> 
                <img src={require("./third/7.jpg")} alt="7" className="practice1"/> 
                <img src={require("./third/8.jpg")} alt="8" className="practice1"/> 
                <img src={require("./third/9.jpg")} alt="9" className="practice1"/> 
                <img src={require("./third/10.jpg")} alt="10" className="practice1"/>
                <img src={require("./third/11.jpg")} alt="11" className="practice1"/> 
                <img src={require("./third/12.jpg")} alt="12" className="practice1"/> 
                <img src={require("./third/13.jpg")} alt="13" className="practice1"/> 
                <img src={require("./third/14.jpg")} alt="14" className="practice1"/> 
                <img src={require("./third/15.jpg")} alt="15" className="practice1"/> 
                <img src={require("./third/16.jpg")} alt="16" className="practice1"/> 
                <img src={require("./third/17.jpg")} alt="17" className="practice1"/> 
                <img src={require("./third/18.jpg")} alt="18" className="practice1"/> 
                <img src={require("./third/19.jpg")} alt="19" className="practice1"/> 
                <img src={require("./third/20.jpg")} alt="20" className="practice1"/>
                <img src={require("./third/21.jpg")} alt="21" className="practice1"/> 
                <img src={require("./third/22.jpg")} alt="22" className="practice1"/> 
                <img src={require("./third/23.jpg")} alt="23" className="practice1"/> 
                <img src={require("./third/24.jpg")} alt="24" className="practice1"/> 
                <img src={require("./third/25.jpg")} alt="25" className="practice1"/> 
                <img src={require("./third/26.jpg")} alt="26" className="practice1"/> 
                <img src={require("./third/27.jpg")} alt="27" className="practice1"/> 
                <img src={require("./third/28.jpg")} alt="28" className="practice1"/> 
                <img src={require("./third/29.jpg")} alt="29" className="practice1"/> 
                <img src={require("./third/30.jpg")} alt="30" className="practice1"/> 
                <img src={require("./third/31.jpg")} alt="31" className="practice1"/> 
                <img src={require("./third/32.jpg")} alt="32" className="practice1"/> 
                <img src={require("./third/33.jpg")} alt="33" className="practice1"/> 
            </div>

            </div>
            {/* </div> */}
            

        </div>
    )
}

export default SequentCalculusInfo